[
  {
    "categories": "Web development",
    "description": "",
    "title": "Agile Web Development with Rails"
  },
  {
    "categories": "python,pyhton web development,flask",
    "description": "",
    "title": "Flask Web Development"
  },
  {
    "categories": "'Web site development -- Handbooks, manuals, etc.','Ruby (Computer program language) -- Handbooks, manuals, etc.','Sites Web -- DeРњРѓveloppement -- Guides, manuels, etc.','Ruby (Langage de programmation) -- Guides, manuels, etc.'",
    "description": "Rails is a full-stack, open source web framework that enables you to create full-featured, sophisticated web-based applications, but with a twist... A full Rails application probably has less total code than the XML you'd need to configure the same application in other frameworks. With this book you'll learn how to use \"ActiveRecord\" to connect business objects and database tables. No more painful object-relational mapping. Just create your business objects and let Rails do the rest. You'll learn how to use the \"Action Pack\" framework to route incoming requests and render pages using easy-to-write templates and components. See how to exploit the Rails service frameworks to send emails, implement web services, and create dynamic, user-centric web-pages using built-in Javascript and Ajax support. There are extensive chapters on testing, deployment, and scaling. You'll see how easy it is to install Rails using your web server of choice (such as Apache or lighttpd) or using its own included web server. You'll be writing applications that work with your favorite database (MySQL, Oracle, Postgres, and more) in no time at all. You'll create a complete online store application in the extended tutorial section, so you'll see how a full Rails application is developed---iteratively and rapidly. Rails strives to honor the Pragmatic Programmer's \"DRY Principle\" by avoiding the extra work of configuration files and code annotations. You can develop in real-time: make a change, and watch it work immediately. Forget XML. Everything in Rails, from templates to control flow to business logic, is written in Ruby, the language of choice for programmers who like to get the job done well (and leave work ontime for a change). Rails is the framework of choice for the new generation of Web 2.0 developers. Agile Web Development with Rails is the book for that generation, written by Dave Thomas (Pragmatic Programmer and author of Programming Ruby) and David Heinemeier Hansson, who created Rails.",
    "title": "Agile web development with rails: a Pragmatic guide"
  },
  {
    "categories": "Computer Science/Web/Server Side Scripting/PHP",
    "description": "I bought this book based on the reviews here. It was the highest rated CakePHP book on Amazon at the time so I figured I couldn't go wrong. I was a little wrong about that...\r\rThe book is pretty easy to follow, and it does a good job introducing you to how CakePHP works and talking you through using the MVC pattern. The reason I gave it such a low rating is because of the code typos that litter the pages and all of the terrible, terrible grammar throughout. It's as though the author didn't speak English natively and the editors didn't bother to fix anything! What's worse, some of the concepts in the book are stated exactly backwards; a read headache for the beginner.\r\rIf you already know PHP to some degree and are at least familiar with CakePHP, the book is pretty helpful for solidifying ideas. It's probably one of the better books I've read on the topic in terms of the order in which they teach you and how it's described. But, if you're new to PHP or CakePHP, don't start with this book; you'll be pulling your hair out trying to figure out where the typos in the code are and interpreting the text.\r\rOverall, I'm happy I picked the book up. It's the second one I've been reading and it's helped me make more sense of how some of the components work, but if you're new and you just want to learn how to use CakePHP, you should consider looking elsewhere, or at least reading The Manual on their website first.",
    "title": "CakePHP Application Development: Step-by-step introduction to rapid web development using the open-source MVC CakePHP framework"
  },
  {
    "categories": "Компьютерная литература\\11 web строительство\\Web - строительство, ASP.NET\\",
    "description": "*  This Starter Kit serves as an entry-level introduction centered around prebuilt projects that developers can easily deploy and customize for their own sites    * Explains how to build good basic Web sites, including design and architecture, for users who plan to build more complex sites in the future    * Details the key site features that beginners like to implement, including catalogs, shopping carts, images, and secure site sections    * The authors use very little code, but where coding is needed, they feature the simple Visual Basic language    * The CD-ROM includes Visual Web Developer 2005 Express Edition",
    "title": "Alex Homer, ASP.NET 2.0 Visual Web Developer 2005"
  },
  {
    "categories": "Computer Science/Web/Server Side Scripting/PHP",
    "description": "Based on the title, the book has so many things to discuss but it actually has less than 400 pages that even include the glossary of terms. The reader might have a second thought about the book since it might not promise to discuss the things written in the chapter.\r\rBut if you go through the chapters, you will be surprised how each topic could be discussed thoroughly in this book. Using the traditional structures in most web and application development books, it slowly introduces each concept before they are brought together in the final chapters. \r\rPHP and Oracle are discussed separately at first with sample codes and situations to ensure that the reader understands each concept. It then goes to discuss who they could be efficiently integrated. The final chapter which is about Ajax is very impressive as it gives the developers a chance to develop an Ajax based application using popular practices in web development. The robustness of Oracle and efficiency of PHP is actually shown in an Ajax based application.\r\rPHP Oracle Web Development: Data processing, Security, Caching, XML, Web Services, and Ajax is a good starting book for any web development professionals and enthusiasts. It covers the basics of web development using PHP and database management of Oracle including an installation guide for Oracle and PHP. If you are looking for a book to start with PHP and Oracle, this book offers a good start. \r\rFor developers who are experienced in this discipline, the book could be a good reference point for developing an application. The sample codes that helps the reader understands the underlying concept of the application with actual scenarios, this PHP and Oracle book is almost too good to pass on.",
    "title": "PHP Oracle Web Development: Data processing, Security, Caching, XML, Web Services, and Ajax: A practical guide to combining the power, performance, scalability, ... time, and high performance of PHP"
  },
  {
    "categories": "Computers\\\\Web-design",
    "description": "",
    "title": "WordPress for Web Developers: An Introduction for Web Professionals"
  },
  {
    "categories": "Computer Science/Web/Server Side Scripting/PHP",
    "description": "Like someone else said, you can learn MODx by finding resources on the internet. I started reading this book to get introduced to the system, and it was OK for that, but I found I didn't really use it or need it when I actually started making my MODx site. It's a good overview/introduction that may help you understand what MODx is and how it functions, but not totally needed if you just want to jump right in and make a site with MODx. Also, since the release of MODx 1.0/1.0.1, the terminology used in this book is no longer correct, so it may actually confuse you (Resources are now Elements, Documents are now Resources, etc.) And I found some of the writing to be awkward.",
    "title": "MODx Web Development"
  },
  {
    "categories": "Computing -Web",
    "description": "Grok 1.0 Web Development is a great introduction to what I think is a very powerful web technology stack: the Zope Toolkit.  Grok provides a way for newcomers and those familiar with other Python web stacks to get started with ZTK, which can often seem insular, cryptic, and inaccessible.  When a user is ready to \"move up\", they can start leveraging the power that underlies Grok.  This book is a good introduction to that stack.  \r\rGrok 1.0 Web Development takes what as I think of as a customary approach to framework introductions, instructing the user on the basic features of the framework by building an application (in this case a to do list manager) and adding features and refining the code as it goes. This works well for Grok -- the amount of boilerplate code is kept to a minimum, by design, so the text can focus on first implementing the feature, then delving deeper to discuss the \"best practice\" around that tool if needed. For example, Chapter 6 covers ZODB Catalogs (index). It starts by defining the search view and user interface so that the reader has a functioning search tool to work with, then takes a diversion to discuss how one best structures their application to support search. These detailed drill downs are one of the most valuable parts of Grok 1.0 Web Development: they help the reader expand their understand beyond just implementing a feature, to implementing in a way that will be flexible and easy to support in the future. The [somewhat brief] advice on when to use the ZODB versus a relational database is another example of practical advice that I appreciated in the book.\r\rGrok 1.0 Web Development is not perfect. In particular I wish the chapter on testing were earlier (the author's admonition that it \"should not be treated as an afterthought\" doesn't seem to jibe with its placement among the advanced topics towards the end of the book. I suppose I'm also a little sensitive to slogging on Zope 3 and it's \"lack\" of agility. I can probably be described as a Zope 3 / Zope component architecture apologist, but it seems the type of agility described is a rather narrow, specific definition. The sprints I did on Zope 3 at PyCon several years contributed more to my understanding and appreciation of test driven development and agile planning than just about anything. Yes, Grok gets it done without the ZCML; I think it's an exercise for the reader as to whether that's better or worse for your application.\r\rI think that the Zope derived frameworks such as Grok and repoze.bfg are some of the most interesting in development today. Grok 1.0 Web Development does a great job of introducing Grok to developers who are new to web programming, or who already have some familiarity with another framework. I recommend it to anyone interested in building extensible web applications with a minimum of boilerplate.",
    "title": "Grok 1.0 Web Development"
  },
  {
    "categories": "Computing -Web",
    "description": "Probably the most complete and updated book that you may find about Javascript.The author made a great job writting about some of the most important topics on javascript development and highlighting the difference among browsers.Most of the topics are already covered in other javascript books I have read before, but not in the way Nicholas does, he usually goes deeper on every topic.If you have some knowledge on javascript and want to reach another level, this is the book for you. If you consider yourself a guru, you may enjoy it as well, but definitely, not for newbies.",
    "title": "Professional JavaScript for Web Developers"
  },
  {
    "categories": "computers, computers/web",
    "description": "A guide to the topics required for state of the art Web development, this book covers wide-ranging topics, including a variety of web development frameworks and best practices. Beginning with coverage of the history of the architecture of Web applications, highlighting the uses of the standard web API to create applications with increasingly sophisticated architectures, developers are led through a discussion on the development of industry accepted best practices for architecture. Described is the history and evolution towards this architecture and the reasons that it is superior to previous efforts. Also provided is an overview of the most popular Web application frameworks, covering their architecture and use. Numerous frameworks exist, but trying to evaluate them is difficult because their documentation stresses their advantages but hides their deficiencies. Here, the same application is built in six different frameworks, providing a way to perform an informed comparison. Also provided is an evaluation of the pros and cons of each framework to assist in making a decision or evaluating a framework on your own. Finally, best practices are covered, including sophisticated user interface techniques, intelligent caching and resource management, performance tuning, debugging, testing, and Web services.",
    "title": "Art of Java Web Development: Struts, Tapestry, Commons, Velocity, JUnit, Axis, Cocoon, InternetBeans, WebWork"
  },
  {
    "categories": "web programming",
    "description": "",
    "title": "Agile.Web.Development.with.Rails.4th.Edition"
  },
  {
    "categories": "Компьютеры//Web-дизайн",
    "description": "",
    "title": "Beginning CSS Web Development: From Novice to Professional"
  },
  {
    "categories": "КНИГИ  WEB-СОЗИДАНИЕ",
    "description": "",
    "title": "Beginning PHP 6, Apache, MySQL 6 Web Development"
  },
  {
    "categories": "Computers\\\\Web-design",
    "description": "",
    "title": "Web development solutions : Ajax, APIs, libraries, and hosted services made easy"
  },
  {
    "categories": "Web Development",
    "description": "",
    "title": "Instant Web Scraping with Java"
  },
  {
    "categories": "Computers / Programming / Software Development",
    "description": "This book turned out to have some solid information on figuring out the designing and packaging concepts you need to keep in mind when setting up an appliction for a tiny screen hand held device.   Forget complex rich-media site artwork that makes people linger on a widescreen monitor and think focused task operated by thumbs.   Reminds me of the efficiency principles from the days of 3278's and VT100's in a way ... there's not a lot of room for noise factor on a screen the size of a playing card.   The book emphasizes this and shows a number of good examples.   The section on style guide planning the top, middle and bottom sections of a display page was worth the price of the book.",
    "title": "Beginning Smartphone Web Development: Building Javascript, CSS, HTML and Ajax-Based Applications for iPhone, Android, Palm Pre, Blackberry, Windows Mobile and Nokia S60"
  },
  {
    "categories": "Development",
    "description": "",
    "title": "Full Stack Web Development with Backbone.js"
  },
  {
    "categories": "Computer science",
    "description": "<P style=\"MARGIN: 0px\">“This book is a great reference for web designers new to ASP.NET who are looking to jump start their development with </P>  <P style=\"MARGIN: 0px\">Visual Web Developer 2008.”</P>  <P style=\"MARGIN: 0px\">Mikhail Arkhipov</P>  <P style=\"MARGIN: 0px\">Principal Development Manager – Web Development Tools</P>  <P style=\"MARGIN: 0px\">Microsoft Corporation</P>  <P style=\"MARGIN: 0px\"> </P>  <P style=\"MARGIN: 0px\">Expression Web introduced ASP.NET to a new group of web developers. This book is designed to help you start using ASP.NET right away to add powerful new features to your website. Don’t worry, you won’t have to learn a lot of programming; instead, you’ll create an ASP.NET application from start to finish using Visual Web Developer 2008, while writing only a very small amount of actual programming code. </P>  <P style=\"MARGIN: 0px\"> </P>  <P style=\"MARGIN: 0px\">DETAILED INFORMATION ON HOW TO…</P>  <P style=\"MARGIN: 0px\">     •    Create and work with websites in Visual Web Developer 2008</P>  <P style=\"MARGIN: 0px\">     •    Use the different compilation and code models in ASP.NET</P>  <P style=\"MARGIN: 0px\">     •    Configure ASP.NET security and other settings</P>  <P style=\"MARGIN: 0px\">     •    Use ASP.NET master pages and user controls</P>  <P style=\"MARGIN: 0px\">     •    Take advantage of ASP.NET membership features for a password-protected website</P>  <P style=\"MARGIN: 0px\">     •    Use form validation in ASP.NET</P>  <P style=\"MARGIN: 0px\">     •    Use CSS, skins, and themes</P>  <P style=\"MARGIN: 0px\">     •    Access, edit, and add data to a database using ASP.NET</P>  <P style=\"MARGIN: 0px\">     •    Send email using ASP.NET</P>  <P style=\"MARGIN: 0px\">     •    Use Ajax and ASP.NET Web services</P>  <P style=\"MARGIN: 0px\">     •    Debug and troubleshoot ASP.NET</P>  <P style=\"MARGIN: 0px\">          . . . and much more!</P>  <P style=\"MARGIN: 0px\"> </P>",
    "title": "The Microsoft Expression Web Developer's Guide to ASP.NET 3.5: Learn to create ASP.NET applications using Visual Web Developer 2008"
  },
  {
    "categories": "Computer science",
    "description": "The author Alexander Kolesnikov has significant experience in programming, dating back to 1979 and Fortran. This is his second book that follows the one published in 2007.\rThe book contains elegant introduction to Tapestry 5 with additional focus on building high performing  scalable web apps. The first chapter is introductory, serves as a advert of Tapestry and a taste of things to come. The second helps reader to configure IDE, because practical exercises are encouraged through out the book.\rFrom the next chapter starts the description of the framework. The third illustrates basic Tapestry mechanics that revolve around \"Page classes\". Author shows how to link them with corresponding views that are enriched html files. Moreover passing data between pages, events and using components is presented. The following chapters provide info on using other parts of the framework like localization, validation etc. and act as a tutorial for building your own components.\rThe book was very easy to read. I can't recall anything that would be difficult to comprehend. Boring parts were rare. Global focus on scalability made it fun to read, because it is not a common part of web app tutorials to remind you how session management influences performance.\rOverall the composition of the book is very neat. The most important stuff is put first although you can skip the parts you are familiar with like I did with IDE configuration.\rHoward Levis-Ship the author of Tapestry says that in a good framework \"the right thing to do is the easiest one\". You can find that idea in every aspect of the framework that is well represented in the book. The focus on scalability is a nice addition to thorough Tapestry 5 description.\rI am not an expert on web apps, so I value the parts that revolve around basics too. Reading the book was fun. Since I did not made any effort into practically using Tapestry during the course of reading it, I was unable tell whether it is better that say JSF with Facelets. However  it provided much insight into web app development with Tapestry. Definitely Tapestry is easier to use, but the real difficulties lie in merging pages with code which I am unable to compare. As usual one needs to try it out in at least medium sized application to find out. Anyway I can recommend this book to anyone who wishes to find out what Tapestry 5 has to offer and anyone who does not feel like an expert in web app development ant would like to go through an introduction on scalable web app development.",
    "title": "Tapestry 5: Building Web Applications: A step-by-step guide to Java Web development with the developer-friendly Apache Tapestry framework"
  },
  {
    "categories": "",
    "description": "The author Alexander Kolesnikov has significant experience in programming, dating back to 1979 and Fortran. This is his second book that follows the one published in 2007.\rThe book contains elegant introduction to Tapestry 5 with additional focus on building high performing  scalable web apps. The first chapter is introductory, serves as a advert of Tapestry and a taste of things to come. The second helps reader to configure IDE, because practical exercises are encouraged through out the book.\rFrom the next chapter starts the description of the framework. The third illustrates basic Tapestry mechanics that revolve around \"Page classes\". Author shows how to link them with corresponding views that are enriched html files. Moreover passing data between pages, events and using components is presented. The following chapters provide info on using other parts of the framework like localization, validation etc. and act as a tutorial for building your own components.\rThe book was very easy to read. I can't recall anything that would be difficult to comprehend. Boring parts were rare. Global focus on scalability made it fun to read, because it is not a common part of web app tutorials to remind you how session management influences performance.\rOverall the composition of the book is very neat. The most important stuff is put first although you can skip the parts you are familiar with like I did with IDE configuration.\rHoward Levis-Ship the author of Tapestry says that in a good framework \"the right thing to do is the easiest one\". You can find that idea in every aspect of the framework that is well represented in the book. The focus on scalability is a nice addition to thorough Tapestry 5 description.\rI am not an expert on web apps, so I value the parts that revolve around basics too. Reading the book was fun. Since I did not made any effort into practically using Tapestry during the course of reading it, I was unable tell whether it is better that say JSF with Facelets. However  it provided much insight into web app development with Tapestry. Definitely Tapestry is easier to use, but the real difficulties lie in merging pages with code which I am unable to compare. As usual one needs to try it out in at least medium sized application to find out. Anyway I can recommend this book to anyone who wishes to find out what Tapestry 5 has to offer and anyone who does not feel like an expert in web app development ant would like to go through an introduction on scalable web app development.",
    "title": "Tapestry 5: Building Web Applications: A step-by-step guide to Java Web development with the developer-friendly Apache Tapestry framework"
  },
  {
    "categories": "Компьютеры//Программирование//Языки программирования",
    "description": "Don't spend your time wading through manuals to learn PHP 5. Spend it doing what you do best - creating web pages! With \"PHP 5 Fast & Easy Web Development\" you can get up and running with PHP 5, Apache, and MySQL with ease. By the time you're finished, you'll be able to display dynamic content, build your own contact management system, create custom reports, work with XML, and much more. Less time, less effort, more results!",
    "title": "PHP 5 Fast and Easy Web Development (Fast and Easy Web Development)"
  },
  {
    "categories": "Компьютеры//Программы//Продукты Macromedia",
    "description": "What better way for readers to learn the newest version of Flash than with the Fast & Easy series!  Macromedia Flash MX 2004 Fast & Easy Web Development presents solution-oriented techniques for creating dynamic animations and graphics for the Web.  Through illustrated step-by step instructions, this title demonstrates the technologies of Macromedia Flash 2004 while providing practical applications as well.   Covering both the Windows and Mac versions, readers will learn important Flash skills such as using symbols and tweening, using vector-based content for faster downloads, and optimizing animations for the Web.  Using a hands-on approach to yield fast results and downloadable sample files to practice techniques, this book is suitable for both beginners and current users aspiring to learn the newest features of Flash.",
    "title": "Macromedia Flash MX 2004 Fast & Easy Web Development (Fast & Easy Web Development)"
  },
  {
    "categories": "",
    "description": "",
    "title": "PHP Fast & Easy Web Development, 2nd Edition (Fast & Easy Web Development)"
  },
  {
    "categories": "",
    "description": "",
    "title": "Perl Fast & Easy Web Development (Fast & Easy Web Development)"
  },
  {
    "categories": "Computers\\\\Programming: Programming Languages",
    "description": "",
    "title": "PHP Oracle web development : data processing, security, caching, XML, web services and AJAX : a practical guide to combining the power, performance, scalability, and reliability of Oracle Database with the ease of use, short development time, and high per"
  },
  {
    "categories": "Computers\\\\Programming",
    "description": "",
    "title": "PHP Oracle Web Development: Data processing, Security, Caching, XML, Web Services, and Ajax: A practical guide to combining the power, performance, ... development time, and high performance of PHP"
  },
  {
    "categories": "",
    "description": "",
    "title": ".NET Mobile Web Developers Guide. Web Developer's Guide"
  },
  {
    "categories": "",
    "description": "",
    "title": "Tapestry 5: Building Web Applications: A step-by-step guide to Java Web development with the developer-friendly Apache Tapestry framework"
  },
  {
    "categories": "",
    "description": "",
    "title": "Learn Java for Web Development: Modern Java Web Development"
  },
  {
    "categories": "",
    "description": "",
    "title": "Flask Web Development: Developing Web Applications with Python"
  },
  {
    "categories": "",
    "description": "",
    "title": "Flask Web Development: Developing Web Applications with Python"
  },
  {
    "categories": "",
    "description": "",
    "title": "Developing Web Apps with Haskell and Yesod: Safety-Driven Web Development"
  },
  {
    "categories": "",
    "description": "",
    "title": "Developing Web Apps with Haskell and Yesod: Safety-Driven Web Development"
  },
  {
    "categories": "Computer Science/Web/Web Design",
    "description": "I've been a programmer / developer all my working life and I've never really understood all that web design stuff. At last I've found a book that explains it in a clear way you can understand without being treated like a rocket scientist or the village idiot. I definately recommend this. It does what it says in the title.",
    "title": "Web Design for Developers: A Programmer's Guide to Design Tools and Techniques (The Pragmatic Programmers)"
  },
  {
    "categories": "Компьютеры\\\\Программирование: Языки программирования",
    "description": "",
    "title": "PHPEclipse: A User Guide: Take advantage of the leading open source integrated development environment to develop, organize, and debug your PHP web development projects."
  },
  {
    "categories": "",
    "description": "With this book readers can become real geographic programmers using the Java programming language. They will find working code examples in Java using some of the many GIS-oriented applications and APIs, and be able to display GIS data on the Web, manipulate GIS data, and programmatically store and retrieve it in geographically enabled databases.",
    "title": "GIS for Web Developers: Adding Where to Your Web Applications (2007)(en)(254s)"
  },
  {
    "categories": "Компьютерная литература\\11 web строительство\\Web - строительство, ASP.NET\\",
    "description": "A complete guide to successful learning using Moodle   - Straight-forward coverage of installing and using the Moodle system   - Working with Moodle features in all learning environments   - A unique course-based approach focuses your attention on designing well structured, interactive, and successful courses<P>    <P>A complete guide to successful learning using Moodle, focused on course development and delivery and using the best educational practices. Moodle is relatively easy to install and use, but the real challenge is to develop a learning process that leverages its power and maps effectively onto the content established learning situation. This book guides you through meeting that challenge.<P>    <P>This unique book gives you more than just a guide to the  Moodle software; it uses Moodle as a route to better teaching, more motivated students, and more successful courses. Moodle is the leading Open Source learning management system. Using Moodle, teachers can easily construct richly textured web based courses.  A course can consist of a number of lessons, with each lesson including reading materials; activities such as quizzes, tests, surveys, and projects; and social elements that encourage interaction and group work between students.Moodle E-Learning Course Development shows you how to use Moodle as a tool to enhance your teaching. It will help you analyse your students' requirements, and come to an understanding of what Moodle can do for them. After that you'll see how to use every feature of Moodle to meet your course goals.<P>    <P>The social constructionist learning philosophy is at the heart of Moodle: we all \"construct\" knowledge through interation with one another and with learning materials in a social way. Moodle E-Learning Course Develelopment will show you how to add static learning material, interactive activities, and social features to your courses so that students reach their learning potential. Whether you want to support traditional class teaching or lecturing, or provide complete online and distance learning courses, this book will prove a powerful resource throughout your use of Moodle.<P>    <P>- Understand what Moodle can do, how it compares to other e-learning packages, and how it can support your teaching strategies   - Install the Moodle software on your own computer or a server, and understand your way around it   - Know how to create different kinds of courses. Moodle can support courses where the group works through the classes with a shared schedule, or where individual students work through at their own pace, or courses where students are free to explore the different topics in their own time. This book will show you how.   - Understand all of Moodle's learning features. Moodle provides features for managing course content, interactive resources, and social activities such as forums and wikis. This book explains what each of these features are, how they work, and most importantly how and when to use them effectively.   - Manage students – so that you can ensure that the right students are going to the right classes; allow students to enrol themselves, or invite students to join a course. You can even set up commercial courses where students pay to sign <P>    <P>William Rice is an experienced trainer and expert on learning and teaching practices. This experience and expertise forms the foundation of his approach: What do we want to teach? How would this best translate into a course? How best can Moodle support these course objectives?Of course, the book contains everything you'd expect from an introduction to Moodle: clear step-by-step instructions, plenty of screenshots, explanations and guides through the many features and options that you have to choose from. Throughout the book, William develops an example course. He uses this example to explore the sort of decisions, design considerations, and thought that goes into developing a successful course.<P>    <P>This book is written for everyone who wants to get the most from Moodle. Beginners to the software will get a thorough guide to how the software works, and some great ideas for getting to a good start with their first course. More experienced Moodlers will find powerful insights into developing more successful and educational courses.<P>",
    "title": "Moodle. E-Learning Course Development"
  },
  {
    "categories": "",
    "description": "",
    "title": "Spring Web Flow 2 Web Development"
  },
  {
    "categories": "WEB дизайн/разработка",
    "description": "Книга Catalyst - Accelerating Perl Web Application Development Catalyst - Accelerating Perl Web Application Development Книги WEB дизайн/разработка Автор: Jonathan Rockway Год издания: 2007 Формат: pdf Издат.:Packt Publishing Страниц: 200 Размер: 3 ISBN: 1847190952 Язык: Русский0 (голосов: 0) Оценка:Книгао хорошем веб-фреймворке написанном на Perl.",
    "title": "Catalyst - Accelerating Perl Web Application Development"
  },
  {
    "categories": "Computer science",
    "description": "<P>Master Spring's well-designed web frameworks to develop powerful web applications  <ul><li>Design, develop, and test your web applications using the Spring Web Flow 2 framework</li>  <li>Enhance your web applications with progressive AJAX, Spring security integration, and Spring Faces</li>  <li>Stay up-to-date with the latest version of Spring Web Flow</li>  <li>Walk through the creation of a bug tracker web application with clear explanations</li></ul></p>      <P><b>In Detail </p>  <P>Many web applications need to take the user through a defined series of steps such as e-commerce checkouts or user registrations. Spring Web Flow works well for rich and flexible user interaction, additionally it helps you to describe the flow of websites in complex processes. Spring Web Flow 2 provides the perfect way to build these kinds of features, keeping them secure, reliable, and easy to maintain.</p>  <P>This book provides a platform on which you can build your own applications and services. It gives detailed information on Spring basics and covers core topics involving testing, security, and so on. We develop a complete, robust web application using the latest version of Spring, where page navigation is done on-the-fly.</p>  <P>This book teaches you how to work with Spring Web Flow. It covers both basic and advanced aspects and provides a detailed reference of the features Spring Web Flow. The book helps readers to extend the framework.</p>  <P>The integration of Spring and Java Server Pages is clearly explained in the book. The book also explains the essential modules of the complete Spring framework stack and teaches how to manage the control flow of a Spring web application.</p>  <P>The Spring Faces module will provide integration between Spring Web Flow and Java Server Faces (JSF). Testing, an important aspect of the software development process is covered towards the end; the question of how to test a Spring Web Flow application is answered.</p>        <P><b>What you will learn from this book? </p>  <ul><li>Explore the features of Spring Web Flow 2 to develop powerful applications</li><li>Extend the framework to take it beyond its out-of-the-box feature set</li><li>Get started with Spring Faces, Spring JavaScript, and Spring Binding and improve the handling of the web flow</li><li>Test your Spring application and rest assured of its quality before going live</li><li>Secure your web applications using Spring Security and Spring Web Flow</li><li>Integrate JavaServer Faces (JSF) with Spring Web Flow to organize and manage the storage of data inside your web application</li></ul>     <P><b>Approach </p>    <P>This book is a tutorial, with plenty of step-by-step instructions beginning with \"getting started\" material, followed by advanced coverage of this technology. The book has a practical approach towards the Spring MVC framework and is packed with practical examples and code. </p>       <P><b>Who this book is written for? </p>  <P>This book is targeted at Java web application developers who want to work on Spring Web Flow. This book is a must-read for those who desire to bridge the gap between the popular web framework and the popular application framework. It requires prior knowledge of the Spring framework, but no prior knowledge of Spring Web Flow. </p>",
    "title": "Spring Web Flow 2 Web Development"
  },
  {
    "categories": "",
    "description": "Easy to read.  Comprehensive.  Easily one of the best IT books that I own.  I am in Australia, but the US emphasis did not detract from my learning experience.",
    "title": "GIS for Web Developers: Adding 'Where' to Your Web Applications"
  },
  {
    "categories": "",
    "description": "Steve Souders has been a leader in documenting and evangelizing techniques for improving web site performance, and his previous book High Performance Web Sites: Essential Knowledge for Front-End Engineers (or the web posting from which it evolved) is essential reading. Even Faster Web Sites is not an updating of that book, but a collection of additional advice from Souders and eight contributors. So the first thing to note is that you should probably only tackle this book if you've already mastered the techniques outlined in High Performance Web Sites.\r\rThe one exception to the advice above may be if you're a web developer who makes heavy use of Javascript, since over half of this book is devoted to AJAX. The remainder of the book addresses a variety of topics of interest to web development professionals in general--optimizing images, writing efficient CSS, advanced techniques for implementing gzipping, and more.\r\rAs with Souders previous book, there is little that will be new to professionals who've kept up with best practices via blogs and the like, but it's still nice to have all the information in one handy book. For those who are just starting to investigate web performance optimization, High Performance Web Sites plus Even Faster Web Sites will get you up to speed quickly.",
    "title": "Even Faster Web Sites: Performance Best Practices for Web Developers"
  },
  {
    "categories": "",
    "description": "This book was largely a rehash of Spring Web Flow XSD's and Configuration files. The author started by introducing a fairly simple login application with a basic Web Flow. The author skimmed over explaining this basic application. I fully expected the author to continue to build on this example and further explain how to setup and configure a flow and use the power of Spring WebFlow to build a modern JSF based web application. Instead I was presented with page after page of XSD samples and configuration file snippets. The author did a very poor job explaining Web Flow concepts and how all this works together. I will have trouble even using this book as an adequate reference book to augment the online Spring documentation. I definitely would not recommend this book.",
    "title": "Spring Web Flow 2 Web Development"
  },
  {
    "categories": "Computing -Web",
    "description": "The book essentially covers how to code up a large application without a framework. In reality if you are working with a large application (or not) you should use an existing framework to manage PHP, HTML templates, and JavaScript. For example CodeIgniter, (I haven't found a PHP HTML templating system I like yet), and Dojo. \r\rtl;dr - has some stuff you should know, but better to let a framework(s) do it for you.",
    "title": "Developing Large Web Applications: Producing Code That Can Grow and Thrive"
  },
  {
    "categories": "",
    "description": "Steve Souders has been a leader in documenting and evangelizing techniques for improving web site performance, and his previous book High Performance Web Sites: Essential Knowledge for Front-End Engineers (or the web posting from which it evolved) is essential reading. Even Faster Web Sites is not an updating of that book, but a collection of additional advice from Souders and eight contributors. So the first thing to note is that you should probably only tackle this book if you've already mastered the techniques outlined in High Performance Web Sites.\r\rThe one exception to the advice above may be if you're a web developer who makes heavy use of Javascript, since over half of this book is devoted to AJAX. The remainder of the book addresses a variety of topics of interest to web development professionals in general--optimizing images, writing efficient CSS, advanced techniques for implementing gzipping, and more.\r\rAs with Souders previous book, there is little that will be new to professionals who've kept up with best practices via blogs and the like, but it's still nice to have all the information in one handy book. For those who are just starting to investigate web performance optimization, High Performance Web Sites plus Even Faster Web Sites will get you up to speed quickly.",
    "title": "Even Faster Web Sites: Performance Best Practices for Web Developers"
  },
  {
    "categories": "",
    "description": "Steve Souders has been a leader in documenting and evangelizing techniques for improving web site performance, and his previous book High Performance Web Sites: Essential Knowledge for Front-End Engineers (or the web posting from which it evolved) is essential reading. Even Faster Web Sites is not an updating of that book, but a collection of additional advice from Souders and eight contributors. So the first thing to note is that you should probably only tackle this book if you've already mastered the techniques outlined in High Performance Web Sites.\r\rThe one exception to the advice above may be if you're a web developer who makes heavy use of Javascript, since over half of this book is devoted to AJAX. The remainder of the book addresses a variety of topics of interest to web development professionals in general--optimizing images, writing efficient CSS, advanced techniques for implementing gzipping, and more.\r\rAs with Souders previous book, there is little that will be new to professionals who've kept up with best practices via blogs and the like, but it's still nice to have all the information in one handy book. For those who are just starting to investigate web performance optimization, High Performance Web Sites plus Even Faster Web Sites will get you up to speed quickly.",
    "title": "Even Faster Web Sites: Performance Best Practices for Web Developers"
  },
  {
    "categories": "Компьютеры//Сети//Интернет",
    "description": "This book is a tutorial, with plenty of step-by-step instructions beginning with \"getting started\" material, followed by advanced coverage of this technology. The book has a practical approach towards the Spring MVC framework and is packed with practical examples and code. This book is targeted at Java web application developers who want to work on Spring Web Flow. This book is a must-read for those who desire to bridge the gap between the popular web framework and the popular application framework. It requires prior knowledge of the Spring framework, but no prior knowledge of Spring Web Flow.",
    "title": "Spring Web Flow 2 Web Development"
  },
  {
    "categories": "Компьютеры//Web-дизайн",
    "description": "Successful web design teams depend on clear communication between developers and their clients—and among members of the development team. Wireframes, site maps, flow charts, and other design diagrams establish a common language so designers and project teams can capture ideas, track progress, and keep their stakeholders informed.    In this all new edition of Communicating Design, author and information architect Dan Brown defines and describes each deliverable, then offers practical advice for creating the documents and using them in the context of teamwork and presentations, independent of methodology. Whatever processes, tools, or approaches you use, this book will help you improve the creation and presentation of your wireframes, site maps, flow charts, and other deliverables.   The book now features:  An improved structure comprising two main sections: Design Diagrams and Design Deliverables. The first focuses on the nuts and bolts of design documentation and the second explains how to pull it all together.  New deliverable: design briefs, as well as updated advice on wireframes, flow charts, and concept models.  More illustrations, to help designers understand the subtle variations and approaches to creating design diagrams. Reader exercises, for those lonely nights when all you really want to do is practice creating wireframes, or for use in workshops and classes. Contributions from industry leaders: Tamara Adlin, Stephen Anderson, Dana Chisnell, Nathan Curtis, Chris Fahey, James Melzer, Steve Mulder, Donna Spencer, and Russ Unger.     “As an educator, I have looked to Communicating Design both as a formal textbook and an informal guide for its design systems that ultimately make our ideas possible and the complex clear.”  —Liz Danzico, from the Foreword  ",
    "title": "Communicating Design: Developing Web Site Documentation for Design and Planning (2nd Edition) (Voices That Matter)"
  },
  {
    "categories": "Компьютеры//Web-дизайн",
    "description": "",
    "title": "Weaving a Library Web: A Guide to Developing Children's Websites"
  }
]